experiments/results/logs/trace_replay-hpa-001/wrk2.txt
Running 30m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 4635.220ms, rate sampling interval: 13402ms
  Thread calibration: mean lat.: 4510.610ms, rate sampling interval: 12746ms
  Thread calibration: mean lat.: 4805.810ms, rate sampling interval: 13729ms
  Thread calibration: mean lat.: 4758.379ms, rate sampling interval: 13770ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.15m     6.00m   19.38m    52.37%
    Req/Sec     8.48      2.29    13.00     82.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.11m 
 75.000%   15.76m 
 90.000%   17.83m 
 99.000%   19.14m 
 99.900%   19.28m 
 99.990%   19.35m 
 99.999%   19.40m 
100.000%   19.40m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6569.983     0.000000            1         1.00
   95617.023     0.100000         6438         1.11
  193200.127     0.200000        12869         1.25
  303562.751     0.300000        19312         1.43
  548929.535     0.400000        25752         1.67
  666370.047     0.500000        32170         2.00
  713031.679     0.550000        35432         2.22
  760217.599     0.600000        38622         2.50
  812646.399     0.650000        41846         2.86
  872939.519     0.700000        45043         3.33
  945815.551     0.750000        48259         4.00
  966787.071     0.775000        49893         4.44
  986710.015     0.800000        51505         5.00
 1010302.975     0.825000        53091         5.71
 1030750.207     0.850000        54725         6.67
 1047003.135     0.875000        56322         8.00
 1059061.759     0.887500        57128         8.89
 1069547.519     0.900000        57928        10.00
 1082130.431     0.912500        58757        11.43
 1091567.615     0.925000        59511        13.33
 1101004.799     0.937500        60336        16.00
 1106247.679     0.943750        60782        17.78
 1111490.559     0.950000        61172        20.00
 1116733.439     0.956250        61562        22.86
 1121976.319     0.962500        61987        26.67
 1127219.199     0.968750        62392        32.00
 1129316.351     0.971875        62549        35.56
 1132462.079     0.975000        62760        40.00
 1135607.807     0.978125        62940        45.71
 1139802.111     0.981250        63172        53.33
 1142947.839     0.984375        63374        64.00
 1143996.415     0.985938        63436        71.11
 1146093.567     0.987500        63566        80.00
 1147142.143     0.989062        63661        91.43
 1148190.719     0.990625        63744       106.67
 1149239.295     0.992188        63837       128.00
 1150287.871     0.992969        63921       142.22
 1151336.447     0.993750        64014       160.00
 1151336.447     0.994531        64014       182.86
 1152385.023     0.995313        64094       213.33
 1152385.023     0.996094        64094       256.00
 1153433.599     0.996484        64168       284.44
 1153433.599     0.996875        64168       320.00
 1153433.599     0.997266        64168       365.71
 1154482.175     0.997656        64222       426.67
 1154482.175     0.998047        64222       512.00
 1155530.751     0.998242        64260       568.89
 1155530.751     0.998437        64260       640.00
 1155530.751     0.998633        64260       731.43
 1156579.327     0.998828        64294       853.33
 1156579.327     0.999023        64294      1024.00
 1156579.327     0.999121        64294      1137.78
 1156579.327     0.999219        64294      1280.00
 1156579.327     0.999316        64294      1462.86
 1157627.903     0.999414        64310      1706.67
 1157627.903     0.999512        64310      2048.00
 1157627.903     0.999561        64310      2275.56
 1158676.479     0.999609        64324      2560.00
 1158676.479     0.999658        64324      2925.71
 1158676.479     0.999707        64324      3413.33
 1158676.479     0.999756        64324      4096.00
 1158676.479     0.999780        64324      4551.11
 1158676.479     0.999805        64324      5120.00
 1159725.055     0.999829        64329      5851.43
 1159725.055     0.999854        64329      6826.67
 1159725.055     0.999878        64329      8192.00
 1159725.055     0.999890        64329      9102.22
 1160773.631     0.999902        64331     10240.00
 1160773.631     0.999915        64331     11702.86
 1161822.207     0.999927        64332     13653.33
 1162870.783     0.999939        64334     16384.00
 1162870.783     0.999945        64334     18204.44
 1162870.783     0.999951        64334     20480.00
 1162870.783     0.999957        64334     23405.71
 1162870.783     0.999963        64334     27306.67
 1163919.359     0.999969        64336     32768.00
 1163919.359     1.000000        64336          inf
#[Mean    =   608852.176, StdDeviation   =   359764.632]
#[Max     =  1162870.784, Total count    =        64336]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  64675 requests in 30.00m, 663.18MB read
  Socket errors: connect 0, read 0, write 0, timeout 25857
Requests/sec:     35.93
Transfer/sec:    377.26KB